runs/cylinder_fresh/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          120;
        startFace       42168;
    }
    outlet
    {
        type            patch;
        nFaces          120;
        startFace       42288;
    }
    top
    {
        type            patch;
        nFaces          184;
        startFace       42408;
    }
    bottom
    {
        type            patch;
        nFaces          184;
        startFace       42592;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          42536;
        startFace       42776;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          128;
        startFace       85312;
    }
)

// ************************************************************************* //
