runs/cylinder_fresh/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM 11
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Background Cartesian mesh for the 2D cylinder Re=100 case.
// Cylinder cells are removed downstream via topoSet + subsetMesh
// (see system/topoSetDict, system/createPatchDict).
//
// Domain: x in [-8D, 24D], y in [-8D, 8D], single cell in z.
// D = 1.0 in mesh units; physical scale set by `scale` below.
//
// Grading: refined near the cylinder via a piecewise blockMesh.
// We use 9 blocks to grade the resolution:
//   - 3 blocks in x: upstream, near, downstream (downstream is longer for the wake)
//   - 3 blocks in y: bottom, middle, top
// Total: 3 * 3 = 9 blocks.

scale 0.001;   // physical D = 0.001 m

// Coordinate landmarks (mesh units, D = 1):
//   x: -8 ......... -1 ......... +1 .................. +24
//   y: -8 ......... -1 ......... +1 ......... +8
//
// "near" region is the 2D x 2D box centred on the cylinder.

vertices
(
    // z = -0.5 plane (12 outer + 4 inner corners = 16 vertices)
    (-8   -8   -0.5)        // 0
    (-1   -8   -0.5)        // 1
    ( 1   -8   -0.5)        // 2
    ( 24  -8   -0.5)        // 3
    (-8   -1   -0.5)        // 4
    (-1   -1   -0.5)        // 5
    ( 1   -1   -0.5)        // 6
    ( 24  -1   -0.5)        // 7
    (-8    1   -0.5)        // 8
    (-1    1   -0.5)        // 9
    ( 1    1   -0.5)        //10
    ( 24   1   -0.5)        //11
    (-8    8   -0.5)        //12
    (-1    8   -0.5)        //13
    ( 1    8   -0.5)        //14
    ( 24   8   -0.5)        //15

    // z = +0.5 plane (same x,y as above)
    (-8   -8    0.5)        //16
    (-1   -8    0.5)        //17
    ( 1   -8    0.5)        //18
    ( 24  -8    0.5)        //19
    (-8   -1    0.5)        //20
    (-1   -1    0.5)        //21
    ( 1   -1    0.5)        //22
    ( 24  -1    0.5)        //23
    (-8    1    0.5)        //24
    (-1    1    0.5)        //25
    ( 1    1    0.5)        //26
    ( 24   1    0.5)        //27
    (-8    8    0.5)        //28
    (-1    8    0.5)        //29
    ( 1    8    0.5)        //30
    ( 24   8    0.5)        //31
);

// Cell counts in each direction per block region:
//   x: upstream (0..1) -> 28 cells, expanding;
//      near    (1..2) -> 64 cells, uniform;
//      downstream (2..3) -> 92 cells, expanding outward.
//   y: bottom (similar shape mirrored);
//      middle -> 64 cells.

blocks
(
    // Bottom row (y in [-8,-1])
    hex (0  1  5  4  16 17 21 20) (28 28 1) simpleGrading (0.2 0.2 1)   // SW
    hex (1  2  6  5  17 18 22 21) (64 28 1) simpleGrading (1   0.2 1)   // S  (near x)
    hex (2  3  7  6  18 19 23 22) (92 28 1) simpleGrading (5   0.2 1)   // SE
    // Middle row (y in [-1,1])  — contains the cylinder
    hex (4  5  9  8  20 21 25 24) (28 64 1) simpleGrading (0.2 1 1)     // W  (near y)
    hex (5  6 10  9  21 22 26 25) (64 64 1) simpleGrading (1   1 1)     // central block — cylinder will be carved out
    hex (6  7 11 10  22 23 27 26) (92 64 1) simpleGrading (5   1 1)     // E  (wake direction)
    // Top row (y in [1,8])
    hex (8  9 13 12  24 25 29 28) (28 28 1) simpleGrading (0.2 5 1)     // NW
    hex (9 10 14 13  25 26 30 29) (64 28 1) simpleGrading (1   5 1)     // N
    hex (10 11 15 14 26 27 31 30) (92 28 1) simpleGrading (5   5 1)     // NE
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0  16 20  4)
            (4  20 24  8)
            (8  24 28 12)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3  7  23 19)
            (7  11 27 23)
            (11 15 31 27)
        );
    }
    top
    {
        type patch;
        faces
        (
            (12 13 29 28)
            (13 14 30 29)
            (14 15 31 30)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (0  1  17 16)
            (1  2  18 17)
            (2  3  19 18)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            // z = -0.5 face of every block
            (0  4  5  1)
            (1  5  6  2)
            (2  6  7  3)
            (4  8  9  5)
            (5  9  10 6)
            (6  10 11 7)
            (8  12 13 9)
            (9  13 14 10)
            (10 14 15 11)
            // z = +0.5 face
            (16 17 21 20)
            (17 18 22 21)
            (18 19 23 22)
            (20 21 25 24)
            (21 22 26 25)
            (22 23 27 26)
            (24 25 29 28)
            (25 26 30 29)
            (26 27 31 30)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
