runs/cylinder_fresh/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM 11
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Re=100 cylinder on the FRESH non-mirrored mesh.
// D = 0.001 m, U = 1.5 m/s, nu = 1.5e-5 m^2/s  ->  Re = 100
// Expected: Cd ~ 1.32-1.40, Cl_pp ~ 0.60-0.66, St ~ 0.165
// (Williamson 1996). Shedding period T_s = D/(U*St) ~ 4.0e-3 s.

solver          incompressibleFluid;

startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         0.2;       // ~75 shedding cycles

deltaT          5e-6;
adjustTimeStep  yes;
maxCo           0.5;
maxDeltaT       2e-5;

writeControl    runTime;
writeInterval   0.005;
purgeWrite      0;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable true;

functions
{
    forceCoeffs1
    {
        type            forceCoeffs;
        libs            ("libforces.so");
        writeControl    timeStep;
        writeInterval   1;

        patches         (cylinder);
        rho             rhoInf;
        rhoInf          1.0;
        liftDir         (0 1 0);
        dragDir         (1 0 0);
        CofR            (0 0 0);
        pitchAxis       (0 0 1);
        magUInf         1.5;
        lRef            0.001;
        Aref            1e-6;
        log             true;
    }
}

// ************************************************************************* //
