runs/cylinder_fresh/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM 11
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Rename oldInternalFaces (created by subsetMesh) to "cylinder" with
// a wall type. Drop any leftover empty oldInternalFaces patches.

pointSync false;

patches
(
    {
        name cylinder;
        patchInfo
        {
            type wall;
        }
        constructFrom patches;
        patches (oldInternalFaces);
    }
);

// ************************************************************************* //
