runs/cylinder_fresh/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    // Transient toward steady (Re=20).
    default         Euler;
}

gradSchemes
{
    // Drop the cellLimited limiter — at Re=100 it adds enough numerical
    // diffusion to damp the Karman shedding instability completely.
    default         Gauss linear;
    grad(U)         Gauss linear;
    grad(k)         Gauss linear;
    grad(omega)     Gauss linear;
    grad(epsilon)   Gauss linear;
}

divSchemes
{
    default         none;

#ifeq ($!ddtSchemes/default steadyState)
    div(phi,U)      bounded Gauss linearUpwind limited;
    turbulence      bounded Gauss limitedLinear 1;
#else
    // Steady-laminar flow at Re=20 — linearUpwind is sufficient.
    div(phi,U)      Gauss linearUpwind limited;
    turbulence      Gauss limitedLinear 1;
#endif

    // Schemes for incompressible solvers
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;
    div(phi,epsilon) $turbulence;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;

    // Additional schemes for compressible solvers
    div(phi,e)      $turbulence;
    div(phi,h)      $turbulence;
    div(phi,K)      $turbulence;
    div(phi,Ekp)    $turbulence;

    div(phid,p)     Gauss upwind;
#ifeq ($!ddtSchemes/default steadyState)
    div(phi,(p|rho)) bounded Gauss upwind;
#else
    div(phi,(p|rho)) Gauss upwind;
#endif

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
